--游戏协议分成主协议和副协议
--主协议定义在这里，每个模块一个主协议
-------------------------------------------------------------------------------------------------------------------
-------------------------------------------------------------------------------------------------------------------
MID_Protocol_System 	= (1) 		--系统协议 
MID_Protocol_Errcode	= (2) 		--错误码协议 
MID_Protocol_Login 		= (100)		--登陆协议
MID_Protocol_Item  		= (101)		--物品协议
MID_Protocol_GM			= (102)		--GM命令协议
MID_Protocol_Lobby		= (103)		--大厅协议
MID_Protocol_Notice		= (104)		--公告协议
MID_Protocol_Cluster	= (105)		--cluster协议


MID_Protocol_ErRenDDZ		= (5001)		--斗地主协议